#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-vf83dA8wuEtao5XL

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_put_function_zip: Reading...
data.archive_file.lambda_get_function_zip: Reading...
data.archive_file.lambda_get_function_zip: Read complete after 0s [id=6e1e102ba2fff483740f42ee9f565a70068355b0]
data.archive_file.lambda_put_function_zip: Read complete after 0s [id=21c696d7d39283d196a31d1002501f63d6c45421]
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4f2a114c-9f30-4784-b67b-5aee7a41f19a]
aws_apigatewayv2_api.lambda_gateway: Refreshing state... [id=j7fhkd4o2m]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
data.aws_route53_zone.philward_io_zone: Reading...
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_s3_bucket.legacy_resume_bucket: Refreshing state... [id=legacy-resume.philward.io]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_s3_bucket.resume_lambda_bucket: Refreshing state... [id=lambda.philward.io]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=542829616420]
aws_route53_record.hashnode_blog_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_blog.philward.io_CNAME]
data.aws_iam_policy_document.kms_ksk_policy: Reading...
data.aws_iam_policy_document.kms_ksk_policy: Read complete after 0s [id=3690054669]
aws_kms_key.dnssec_kms_key: Refreshing state... [id=43f31946-1cde-40ab-a194-21839adc741f]
aws_route53_key_signing_key.philward_io_ksk: Refreshing state... [id=Z003529526RCV8G5J1PS7,philward_io_KSK]
data.aws_route53_zone.philward_io_zone: Read complete after 0s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_hosted_zone_dnssec.philward_io_dnssec: Refreshing state... [id=Z003529526RCV8G5J1PS7]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20230115192134949800000001]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_apigatewayv2_stage.lambda_gateway_stage: Refreshing state... [id=serverless_lambda_stage]
aws_s3_bucket_public_access_block.resume_lambda_bucket_access_block: Refreshing state... [id=lambda.philward.io]
aws_s3_object.lambda_get_function_object: Refreshing state... [id=get_function.zip]
aws_s3_object.lambda_put_function_object: Refreshing state... [id=put_function.zip]
aws_s3_bucket_public_access_block.resume_bucket_access_block: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Reading...
data.aws_iam_policy_document.legacy_resume_bucket_policy_document: Read complete after 0s [id=1724937241]
aws_s3_bucket_website_configuration.legacy_bucket_website: Refreshing state... [id=legacy-resume.philward.io]
aws_s3_bucket_acl.legacy_resume_bucket_acl: Refreshing state... [id=legacy-resume.philward.io,public-read]
aws_s3_object.legacy_resume_bucket_contents["reset-fonts-grids.css"]: Refreshing state... [id=reset-fonts-grids.css]
aws_s3_object.legacy_resume_bucket_contents["legacy_index.html"]: Refreshing state... [id=legacy_index.html]
aws_s3_object.legacy_resume_bucket_contents["resume.css"]: Refreshing state... [id=resume.css]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]
aws_s3_bucket_policy.legacy_resume_bucket_policy: Refreshing state... [id=legacy-resume.philward.io]
aws_lambda_function.put_function: Refreshing state... [id=put_function]
aws_lambda_function.get_function: Refreshing state... [id=get_function]
aws_route53_record.legacy_resume_record: Refreshing state... [id=Z003529526RCV8G5J1PS7_legacy-resume.philward.io_A]
aws_cloudwatch_log_group.get_function_log_group: Refreshing state... [id=/aws/lambda/get_function]
aws_apigatewayv2_integration.get_function: Refreshing state... [id=wsojpxo]
aws_apigatewayv2_integration.put_function: Refreshing state... [id=mvi33fa]
aws_cloudwatch_log_group.put_function_log_group: Refreshing state... [id=/aws/lambda/put_function]
aws_lambda_permission.api_gw_put: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_permission.api_gw_get: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_route.get_function: Refreshing state... [id=tlz33nb]
aws_apigatewayv2_route.put_function: Refreshing state... [id=uj57p0c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "count_type"
      + id               = (known after apply)
      + name             = "cloud-resume-challenge"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "count_type"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_dynamo_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamo_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::542829616420:policy/LambdaDynamoPolicy"
      + role       = "serverless_lambda"
    }

  # aws_lambda_function.get_function will be updated in-place
  ~ resource "aws_lambda_function" "get_function" {
        id                             = "get_function"
      ~ last_modified                  = "2023-01-16T20:02:47.243+0000" -> (known after apply)
      ~ source_code_hash               = "pU2m0SSmHXYl+h4w5lVsTiQjk0UFRrZbapRw2TI1VjU=" -> "cG6kJbKMFQ86+ZWTbLiMjrlOMYfFJn4bXonfGxALo/I="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.put_function will be updated in-place
  ~ resource "aws_lambda_function" "put_function" {
        id                             = "put_function"
      ~ last_modified                  = "2023-01-16T20:02:47.245+0000" -> (known after apply)
      ~ source_code_hash               = "5VIrYVtD06YUOV6PSXhyPlPHzOrAMmTbBsg8hPQvfQI=" -> "NmchdOVo3QSU9/EtXk23reugmA7WjrQBfUHyiNEm1kI="
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_get_function_object will be updated in-place
  ~ resource "aws_s3_object" "lambda_get_function_object" {
      ~ etag               = "8c62d2883c026d3c3476f2b8ef92d6b3" -> "b03f7e83b644a65288e2b8c908cf5745"
        id                 = "get_function.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_put_function_object will be updated in-place
  ~ resource "aws_s3_object" "lambda_put_function_object" {
      ~ etag               = "cb46a4c2e4f2e0ccf493e86ddfe1cd55" -> "af0076a1e9cf218ef59c1cd94ae9c17a"
        id                 = "put_function.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*